{
  "BufClose.nvim": { "branch": "master" },
  "Comment.nvim": { "branch": "master" },
  "CopilotChat.nvim": { "branch": "main" },
  "LuaSnip": { "branch": "master" },
  "Otree.nvim": { "branch": "main" },
  "aibou.nvim": { "branch": "main" },
  "animatedbg.nvim": { "branch": "main" },
  "apidocs.nvim": { "branch": "main" },
  "ascii.nvim": { "branch": "master" },
  "auto-cmdheight.nvim": { "branch": "main" },
  "avante.nvim": { "branch": "main" },
  "barbar.nvim": { "branch": "master" },
  "blink-cmp-conventional-commits": { "branch": "main" },
  "blink-cmp-dictionary": { "branch": "master" },
  "blink-cmp-git": { "branch": "master" },
  "blink-cmp-spell": { "branch": "master" },
  "blink-cmp-tmux": { "branch": "main" },
  "blink-emoji.nvim": { "branch": "master" },
  "blink-nerdfont.nvim": { "branch": "main" },
  "blink-ripgrep.nvim": { "branch": "main" },
  "blink-yanky.nvim": { "branch": "main" },
  "blink.cmp": { "branch": "main" },
  "blink.compat": { "branch": "main" },
  "bloat.nvim": { "branch": "master" },
  "buffer-reopen.nvim": { "branch": "main" },
  "calendar-vim": { "branch": "master" },
  "ccc.nvim": { "branch": "main" },
  "ccusage.nvim": { "branch": "main" },
  "chezmoi.vim": { "branch": "main" },
  "claude-code.nvim": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-cmdline": { "branch": "main" },
  "cmp-dap": { "branch": "master" },
  "cmp-emoji": { "branch": "main" },
  "cmp-go-deep": { "branch": "master" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp-tmux": { "branch": "main" },
  "cmp_luasnip": { "branch": "master" },
  "cmp_yanky": { "branch": "main" },
  "codecompanion-history.nvim": { "branch": "main" },
  "codecompanion.nvim": { "branch": "main" },
  "colorful-menu.nvim": { "branch": "master" },
  "conform.nvim": { "branch": "master" },
  "coop.nvim": { "branch": "main" },
  "copilot-lualine": { "branch": "main" },
  "copilot.lua": { "branch": "master" },
  "copiloutre.nvim": { "branch": "main" },
  "crates.nvim": { "branch": "main" },
  "cronex.nvim": { "branch": "main" },
  "css-vars.nvim": { "branch": "main" },
  "csvview.nvim": { "branch": "main" },
  "ctags-lsp.nvim": { "branch": "main" },
  "cursor_open.nvim": { "branch": "main" },
  "cyberdream.nvim": { "branch": "main" },
  "dap-breakpoints.nvim": { "branch": "master" },
  "debugmaster.nvim": { "branch": "main" },
  "denops-shared-server.vim": { "branch": "main" },
  "denops.vim": { "branch": "main" },
  "devdocs.nvim": { "branch": "main" },
  "dial.nvim": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "displace.nvim": { "branch": "main" },
  "dotfyle-metadata.nvim": { "branch": "main" },
  "dps-translate-vim": { "branch": "main" },
  "dressing.nvim": { "branch": "master" },
  "drop.nvim": { "branch": "main" },
  "ecolog.nvim": { "branch": "main" },
  "eskk.vim": { "branch": "master" },
  "ex-colors.nvim": { "branch": "main" },
  "extend_word_motion.nvim": { "branch": "main" },
  "feed.nvim": { "branch": "main" },
  "fidget.nvim": { "branch": "main" },
  "flash.nvim": { "branch": "main" },
  "flatjson.nvim": { "branch": "main" },
  "floatwindow.nvim": { "branch": "main" },
  "friendly-snippets": { "branch": "main" },
  "gamify.nvim": { "branch": "main" },
  "ghostty-ls": { "branch": "main" },
  "ghostty.nvim": { "branch": "master" },
  "gitgraph.nvim": { "branch": "main" },
  "github-nvim-theme": { "branch": "main" },
  "gitlinker.nvim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "grug-far.nvim": { "branch": "main" },
  "hardtime.nvim": { "branch": "main" },
  "haunt.nvim": { "branch": "master" },
  "helpview.nvim": { "branch": "main" },
  "hlargs.nvim": { "branch": "main" },
  "hlchunk.nvim": { "branch": "main" },
  "hover.nvim": { "branch": "main" },
  "http.nvim": { "branch": "main" },
  "huez.nvim": { "branch": "stable" },
  "hydra.nvim": { "branch": "main" },
  "image.nvim": { "branch": "master" },
  "img-clip.nvim": { "branch": "main" },
  "in-and-out.nvim": { "branch": "master" },
  "inc-rename.nvim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "interference.nvim": { "branch": "main" },
  "jq-playground.nvim": { "branch": "main" },
  "key-analyzer.nvim": { "branch": "main" },
  "kulala.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lazydev.nvim": { "branch": "main" },
  "lazymanager.nvim": { "branch": "main" },
  "logger.nvim": { "branch": "master" },
  "lorem-ipsum.nvim": { "branch": "master" },
  "lspctl.nvim": { "branch": "fix-doc" },
  "lspkind.nvim": { "branch": "master" },
  "lspsaga.nvim": { "branch": "main" },
  "lualine-lsp-status": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "luminate.nvim": { "branch": "main" },
  "luvit-meta": { "branch": "main" },
  "markview.nvim": { "branch": "main" },
  "mason-conform.nvim": { "branch": "master" },
  "mason-extra-cmds": { "branch": "main" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason-nvim-dap.nvim": { "branch": "main" },
  "mason-nvim-lint": { "branch": "patch" },
  "mason.nvim": { "branch": "main" },
  "mcphub.nvim": { "branch": "main" },
  "migemo-search.vim": { "branch": "master" },
  "mini.icons": { "branch": "main" },
  "mkdir.nvim": { "branch": "main" },
  "moody.nvim": { "branch": "main" },
  "multicursor.nvim": { "branch": "1.0" },
  "namu.nvim": { "branch": "main" },
  "neoconf.nvim": { "branch": "main" },
  "neogit": { "branch": "master" },
  "neogit-ai-commit.nvim": { "branch": "main" },
  "neoscroll.nvim": { "branch": "master" },
  "neotest": { "branch": "master" },
  "neotest-bash": { "branch": "main" },
  "neotest-busted": { "branch": "master" },
  "neotest-deno": { "branch": "main" },
  "neotest-plenary": { "branch": "master" },
  "neotest-vim-test": { "branch": "master" },
  "neotest-vitest": { "branch": "main" },
  "neovimcraft.nvim": { "branch": "main" },
  "noice.nvim": { "branch": "main" },
  "none-ls.nvim": { "branch": "main" },
  "notesium": { "branch": "master" },
  "nui.nvim": { "branch": "main" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-bqf": { "branch": "main" },
  "nvim-buddy": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-cursorline": { "branch": "main" },
  "nvim-dap": { "branch": "master" },
  "nvim-dap-commands": { "branch": "main" },
  "nvim-dap-ui": { "branch": "master" },
  "nvim-dap-view": { "branch": "main" },
  "nvim-ghost.nvim": { "branch": "main" },
  "nvim-hlslens": { "branch": "main" },
  "nvim-html-css": { "branch": "main" },
  "nvim-lint": { "branch": "master" },
  "nvim-lsp-file-operations": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-navbuddy": { "branch": "master" },
  "nvim-navic": { "branch": "master" },
  "nvim-nio": { "branch": "master" },
  "nvim-notify": { "branch": "master" },
  "nvim-nu": { "branch": "main" },
  "nvim-surround": { "branch": "main" },
  "nvim-tree-preview.lua": { "branch": "main" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-context": { "branch": "master" },
  "nvim-treesitter-textsubjects": { "branch": "master" },
  "nvim-ts-autotag": { "branch": "main" },
  "nvim-ts-context-commentstring": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "nvim_context_vt": { "branch": "master" },
  "nvumi": { "branch": "main" },
  "obsidian-kensaku.nvim": { "branch": "main" },
  "obsidian.nvim": { "branch": "main" },
  "octohub.nvim": { "branch": "main" },
  "oil-git.nvim": { "branch": "main" },
  "oil-lsp-diagnostics.nvim": { "branch": "master" },
  "oil.nvim": { "branch": "master" },
  "open-official-doc.nvim": { "branch": "main" },
  "orphans.nvim": { "branch": "main" },
  "output-panel.nvim": { "branch": "main" },
  "package-info.nvim": { "branch": "master" },
  "palette.nvim": { "branch": "master" },
  "pastelnight.nvim": { "branch": "main" },
  "pastevim.nvim": { "branch": "main" },
  "pathlib.nvim": { "branch": "main" },
  "patterns.nvim": { "branch": "main" },
  "pendulum-nvim": { "branch": "main" },
  "persistent-breakpoints.nvim": { "branch": "main" },
  "pickme.nvim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "quicker.nvim": { "branch": "master" },
  "readermode.nvim": { "branch": "main" },
  "render-markdown.nvim": { "branch": "main" },
  "rssfeed.nvim": { "branch": "main" },
  "rustaceanvim": { "branch": "master" },
  "rustowl": { "branch": "main" },
  "rzls.nvim": { "branch": "main" },
  "satellite.nvim": { "branch": "main" },
  "schemastore.nvim": { "branch": "main" },
  "scratch-runner.nvim": { "branch": "master" },
  "screenkey.nvim": { "branch": "main" },
  "scroll-it.nvim": { "branch": "main" },
  "senpai.nvim": { "branch": "main" },
  "silhouette.nvim": { "branch": "main" },
  "skkeleton": { "branch": "main" },
  "skkeleton_indicator.nvim": { "branch": "v2" },
  "smart-open.nvim": { "branch": "0.2.x" },
  "smart-splits.nvim": { "branch": "master" },
  "smart-translate.nvim": { "branch": "main" },
  "smear-cursor.nvim": { "branch": "main" },
  "snacks.nvim": { "branch": "main" },
  "snake.nvim": { "branch": "main" },
  "speed.nvim": { "branch": "main" },
  "sqlite.lua": { "branch": "master" },
  "sqls.nvim": { "branch": "main" },
  "surround-ui.nvim": { "branch": "main" },
  "telekasten.nvim": { "branch": "main" },
  "telescope-egrepify.nvim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-insert-path.nvim": { "branch": "master" },
  "telescope-media-files.nvim": { "branch": "master" },
  "telescope-treesitter-info.nvim": { "branch": "master" },
  "telescope.nvim": { "branch": "master" },
  "template.nvim": { "branch": "main" },
  "tetris.nvim": { "branch": "main" },
  "timber.nvim": { "branch": "main" },
  "tiny-glimmer.nvim": { "branch": "main" },
  "tiny-inline-diagnostic.nvim": { "branch": "main" },
  "tinysegmenter.nvim": { "branch": "main" },
  "todo-comments.nvim": { "branch": "main" },
  "tokyonight.nvim": { "branch": "main" },
  "translate.nvim": { "branch": "main" },
  "transparent.nvim": { "branch": "main" },
  "tree-sitter-ghostty": { "branch": "main" },
  "treesj": { "branch": "main" },
  "treesorter.nvim": { "branch": "master" },
  "treewalker.nvim": { "branch": "main" },
  "trouble.nvim": { "branch": "main" },
  "tutorial.nvim": { "branch": "main" },
  "twilight.nvim": { "branch": "main" },
  "typos.nvim": { "branch": "main" },
  "utils.nvim": { "branch": "main" },
  "vim-cargo-make": { "branch": "master" },
  "vim-duckscript": { "branch": "master" },
  "vim-illuminate": { "branch": "master" },
  "vim-kitty": { "branch": "main" },
  "vim-quickrun": { "branch": "master" },
  "vim-teraterm": { "branch": "master" },
  "vim-test": { "branch": "master" },
  "vim-toml": { "branch": "main" },
  "vimdoc-ja": { "branch": "master" },
  "visual-whitespace.nvim": { "branch": "main" },
  "wezterm-types": { "branch": "main" },
  "which-key.nvim": { "branch": "main" },
  "winresizer": { "branch": "master" },
  "yanky.nvim": { "branch": "main" },
  "yazi.nvim": { "branch": "main" }
}
