0rax/fish-bd
americanhanko/fish-spin
decors/fish-ghq
eskori/penumbra-theme.fish
halostatue/fish-docker@v1.x
jethrokuan/z
jorgebucaran/fisher
jorgebucaran/getopts.fish
mimikun/def
mimikun/editorconfig
mimikun/gcd
mimikun/numeronym
mimikun/pcd
mimikun/read_confirm
mimikun/re_boot
mimikun/shut_down
mimikun/supersync
mimikun/update_asdf_neovim_nightly
mimikun/update_asdf_zig_master
mimikun/update_bw
mimikun/update_chromedriver
mimikun/update_completions
mimikun/update_docker_compose
mimikun/update_geckodriver
mimikun/update_peco
mimikun/vup
oh-my-fish/plugin-thefuck
sijad/gitignore
