;; markdown
---
tags:
  - "#原神"
  - "#Genshin"
---
# [[原神]]vX.Y-XXXXXXXXXX

<< 前バージョンへのリンク | 次バージョンへのリンク >>

[ここにTwitch配信の詳細リンクを貼る](https://example.com)

※第一週：
※第二週：
※第三週：

[ここにリリースノートのリンクを貼る](https://example.com)


## キャラ育成方針
[[原神-キャラクター聖遺物厳選]]


### キャラ1
- 武器
	- 詳細情報待ち
- 適正セット効果
	- 詳細情報待ち
- メインOP
	- 砂: 詳細情報待ち
	- 杯: 詳細情報待ち
	- 冠: 詳細情報待ち
- サブOP優先度
	- 詳細情報待ち
- 装着
	- キャラ名


## チェックリスト
- [ ] 新エリア
	- [ ] 詳細情報待ち
- [ ] XXXX評判開放条件
	- [ ] 詳細情報待ち
- [ ] XXXXデイリー依頼開放条件
	- [ ] 詳細情報待ち
- [ ] 新武器設計図
	- [ ] 詳細情報待ち
- [ ] 新武器・紀行武器
	- [ ] 詳細情報待ち
- [ ] 新武器・イベント武器
	- [ ] 詳細情報待ち
- [ ] 新武器・釣り協会報酬
	- [ ] 詳細情報待ち
- [ ] 釣り協会
	- [ ] 釣り竿名
		- [ ] 魚名
	- [ ] 武器精錬素材名
		- [ ] nつ目
			- [ ] 魚名
- [ ] 新聖遺物
	- [ ] 詳細情報待ち
		- [ ] 花
			- [ ] 星4
			- [ ] 星5
		- [ ] 羽
			- [ ] 星4
			- [ ] 星5
		- [ ] 砂
			- [ ] 星4
			- [ ] 星5
		- [ ] 杯
			- [ ] 星4
			- [ ] 星5
		- [ ] 冠
			- [ ] 星4
			- [ ] 星5
- [ ] 新素材
	- [ ] XXXX特産
		- [ ] 詳細情報待ち
	- [ ] 汎用素材
		- [ ] 詳細情報待ち
	- [ ] 食材
		- [ ] 詳細情報待ち
	- [ ] 木材
		- [ ] 詳細情報待ち
	- [ ] キャラ武器育成素材
		- [ ] 敵名
			- [ ] 上
			- [ ] 中
			- [ ] 下
	- [ ] 新武器原型
		- [ ] 詳細情報待ち
	- [ ] 武器突破素材
		- [ ] 詳細情報待ち
	- [ ] キャラ突破素材
		- [ ] フィールドボス名
			- [ ] 詳細情報待ち
	- [ ] 天賦本
		- [ ] 「XX」の
			- [ ] 教え
			- [ ] 導き
			- [ ] 哲学
- [ ] 新便利アイテム
	- [ ] 詳細情報待ち
- [ ] 新秘境
	- [ ] 詳細情報待ち
- [ ] アチーブメント
	- [ ] [paimon.moe](https://paimon.moe) で確認
- [ ] 失われたX神の瞳
	- [ ] XレベルのY個
- [ ] XXXXの地霊壇
	- [ ] Nつ目
- [ ] 印投入施設
	- [ ] 詳細情報待ち
- [ ] 塵歌壺調度品
	- [ ] [[原神-塵歌壺関係#原神vX.Y-XXXXXXXXXX 時点]]
- [ ] パインアメ
	- [ ] 詳細情報待ち


### 魔神任務
- [ ] 第x章・第y幕「XXXX」


### 伝説任務
- [ ] XXXXの章
	- [ ] XXXX伝説任務


### 部族見聞
- [ ] 詳細情報待ち


### 世界任務

#### シリーズ任務
- [ ] 詳細情報待ち


#### 単発任務
- [ ] 詳細情報待ち


### 新料理レシピ
- XXXXで購入
	- [ ] 詳細情報待ち
- XXXX都市評判で獲得
	- [ ] 詳細情報待ち
- 世界任務クリアで獲得
	- [ ] 詳細情報待ち
- 世界探索で獲得
	- [ ] 詳細情報待ち
- イベントで獲得
	- [ ] 詳細情報待ち
- 入手方法詳細情報待ち
	- [ ] 詳細情報待ち
- オリジナル料理
	- [ ] 料理名
		- XXXXオリジナル料理
		- XXXXを料理


### 新敵
- [ ] 詳細情報待ち


### 新地方伝説
- [ ] 詳細情報待ち


### 新生物
- [ ] 詳細情報待ち


### 新捕獲可能生物
- [ ] 詳細情報待ち


### 七聖召喚バランス調整
- 詳細情報待ち


### その他
- 詳細情報待ち


